//-----------------------------------------------------------------------------
// @brief  障害物：浮遊する.
// 2016 Takeru Yui All Rights Reserved.
//-----------------------------------------------------------------------------
#include "ObstructFloat.h"

#define _USE_MATH_DEFINES
#include <math.h>

//-----------------------------------------------------------------------------
// @brief  コンストラクタ.
//-----------------------------------------------------------------------------
ObstructFloat::ObstructFloat(int sourceModelHandle)
	: ObstructBase(sourceModelHandle)
{
	pos = VGet(0, 0, 0);
	velocity = (VGet(0.0f, 0.0f, BALL_Z_SPEED));
}

//-----------------------------------------------------------------------------
// @brief  デストラクタ.
//-----------------------------------------------------------------------------
ObstructFloat::~ObstructFloat()
{
	// 処理なし.
}