//-----------------------------------------------------------------------------
// @brief  ヒットチェック.
// 2016 Takeru Yui All Rights Reserved.
//-----------------------------------------------------------------------------

#include "HitChecker.h"
/*
* 名前の変更や追加・削除は行っても大丈夫です
*/

// コンストラクタ
HitChecker::HitChecker()
	:mDamageImg(-1)
	,mHP(0)
	,mIsHitFlag(false)
{
}

// デストラクタ
HitChecker::~HitChecker()
{
}

// エフェクト等を描画
void HitChecker::Draw()
{
}

//-----------------------------------------------------------------------------
// @brief  当たっているかどうかの判定処理.
//-----------------------------------------------------------------------------
void HitChecker::Check()
{
}

